# -*- coding: utf-8 -*-
"""Untitled64.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/10ipWACyiqHkK-vVTtkkwHKaWoXf4CuyO

Задача 1.
Даны два списка,  нужно вернуть элементы,
которые есть в 1-ом списке, но нет во 2-ом.
Оценить эффективность своего решения.


 Задача 2.  
 Дан массив целых чисел. Нужно удалить из него нули. 
 Можно использовать только О(1) дополнительной памяти.
"""

#Task_1

a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]
b = [1, 2, 7, 9]

# O(len(a)) + O(len(b))

result = set(a).difference(b)
print(result)


#Task_2

ls_1 = [0, 1, 0, 0, 4, 5, 6, 7, 0, 8, -4, 0]


def list_sort(lst: list) -> list:
  for elem in lst:
    if elem == 0:
      lst.remove(elem)
  
  for elem in lst:
    if elem == 0:
      lst.remove(elem)
        
  return lst


print(list_sort(ls_1))
